% ќбратное отображение точек созвезди€
%> @file demapping.m
% =========================================================================
%> @brief ќтображение бит на созвездие
%> @param symbols точки в IQ пространстве
%> @param constellation условное обозначение дл€ типа модул€ции:
%> [1] - BPSK, [2] - QPSK, [3] - 8PSK, [4] - 16APSK, [5] - 16QAM
%> @param softFlag [0] - жесткое решение, [1] - м€гкое решение
%> @param SNR отношение сигнал/шум (необходимо дл€ м€гкого решени€)
%> @return out биты при жестком решении, LLR при м€гком решении 
% =========================================================================
function out = demapping (symbols, constellation, softFlag, SNR)
   %>todo ћесто дл€ вашего кода
end
