% ¬ычисление колличества ошибок в битовой последовательности
%> @file Nerr.m
% =========================================================================
%> @brief ¬ычисление колличества ошибок в битовой последовательности
%> @param bit идеальна€ битова€ последовательность
%> @param rxbit прин€та€ битова€ последовательность
%> @return ERR число ошибок
%> »спользуйте функции xor и sum 
% =========================================================================
function ERR = Nerr (bit, rxbit)
ERR = 0;
    for x = 1:length(bit)
        if bit(x) == rxbit(x)
        else ERR = ERR + 1;
        end
    end
end