% Домашнее задание №4. Канальное кодирование. Кодирование и декодирование
%> @file hw4.m
% =========================================================================
%> Подготовка рабочего места
% =========================================================================
    %> Отчистка workspace
    clear all;
    %> Закрытие рисунков
    close all;
    %> Отчистка Command Window
    clc;
% =========================================================================
%> Задание 1. Реализуйте алгоритм итеративного декодирование для примера из лекции.
%> Смысл - понять что такое пересылка сообщений.
% =========================================================================
%> Принятое слово
C = [1 1 0 1 0 1 0 1];
%> Проверочная матрица
H = [0 1 0 1 1 0 0 1;...
     1 1 1 0 0 1 0 0;...
     0 0 1 0 0 1 1 1;...
     1 0 0 1 1 0 1 0];
%> bits - переданное сообщение. Нужно вычислить
bits = C;
J = C.*H;
K = xor(xor(xor(xor(xor(xor(xor(J(:,1),J(:,2)),J(:,3)),J(:,4)),J(:,5)),J(:,6)),J(:,7)),J(:,8));
L = find(~sum(xor(H,K)));
bits(L) = ~C(L);
% =========================================================================
chack = [1 0 0 1 0 1 0 1];
err = sum(xor(chack, bits))
% =========================================================================
%> Задание 2. 
%> Использюя стандартный кодер и декодер LDPC кода comm.LDPCEncoder,
%> comm.LDPCDecoder и ваши функции mapping demapping для QPSK постройте BER 
%> характеристку до 10^-7 для кода dvbs2ldpc(1/2) (default) для 10 и 50 итераций
%> декодирования. Напищите в комментариях какое решение дает лучшй
%> результат, почему? 
% =========================================================================
%> @todo место для вашго кода
% ....

% =========================================================================
%> Задание 3. 
%> Использюя стандартный кодер и декодер LDPC кода comm.LDPCEncoder,
%> comm.LDPCDecoder и ваши функции mapping demapping постройте BER 
%> характеристку до 10^-7 для двух кодов из dvbs2ldpc().
%> В комментариях расчитайте предел Шеннона для данной кодовой скорости и 
%> типа модуляции,сравните со значением по уровню 10^-7 (оцененым из графика). 
%> Оцените качество кода.
% =========================================================================
%> @todo место для вашго кода
% ....



