% Фильтрация
%> @file filtration.m
% =========================================================================
%> @brief Фильтрация
%> @param sign входной сигнал сигнал
%> @param coeff коэффиценты фильтра
%> @param nsamp число выборок на символ
%> @param UpSempFlag [1] -  фильтр с передескретезацией,[0] - фильтр без передескретизации 
%> @return filtsign отфильтрованный сигнал 
% =========================================================================
function filtsign = filtration(sign, coeff, nsamp, UpSempFlag)
    %> @todo место для вашего кода
end 